espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sl_btmesh_capi_types.h
/******************************************************************************/
/**
 * @file   sl_btmesh_capi_types.h
 * @brief  Silicon Labs Bluetooth Mesh C API
 *
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc. Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement. This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/

#ifndef SL_BTMESH_CAPI_TYPES_H_
#define SL_BTMESH_CAPI_TYPES_H_

/** forward declaration for SDK use  */
struct bgbuf_t;

#include <stddef.h>
#include <stdint.h>
#include <stdbool.h>
#include "sl_btmesh_compatibility_macros.h"
#include "sl_status.h"
#include "sl_btmesh_memory_config.h"
#include <stdbool.h>

/** Dummy vendor ID for Mesh specification models */
#define MESH_SPEC_VENDOR_ID 0xffff

/** Model ID list */

/**  Scene Server model ID  */
#define MESH_SCENE_SERVER_MODEL_ID 0x1203
/** Scene Setup Server model ID */
#define MESH_SCENE_SETUP_SERVER_MODEL_ID 0x1204
/** Scene Client model ID */
#define MESH_SCENE_CLIENT_MODEL_ID 0x1205
/**  LC Server model ID  */
#define MESH_LC_SERVER_MODEL_ID 0x130F
/** LC Setup Server model ID */
#define MESH_LC_SETUP_SERVER_MODEL_ID 0x1310
/** LC Client model ID */
#define MESH_LC_CLIENT_MODEL_ID 0x1311
/** Scheduler Server model ID */
#define MESH_SCHEDULER_SERVER_MODEL_ID       0x1206
/** Scheduler Server Setup Server model ID **/
#define MESH_SCHEDULER_SETUP_SERVER_MODEL_ID 0x1207
/** Scheduler Client model ID */
#define MESH_SCHEDULER_CLIENT_MODEL_ID       0x1208

#if FEATURE_MESH_GATT

/** Mesh GATT provisioning service UUID */
#define MESH_GATT_SERVICE_PROVISIONING_UUID "\x27\x18"
/** Mesh GATT provisioning service data in characteristic UUID */
#define MESH_GATT_SERVICE_PROVISIONING_DATA_IN_UUID "\xdb\x2a"
/** Mesh GATT provisioning service data out characteristic UUID */
#define MESH_GATT_SERVICE_PROVISIONING_DATA_OUT_UUID "\xdc\x2a"

/** Mesh GATT proxy service UUID */
#define MESH_GATT_SERVICE_PROXY_UUID "\x28\x18"
/** Mesh GATT proxy service data in characteristic UUID */
#define MESH_GATT_SERVICE_PROXY_DATA_IN_UUID "\xdd\x2a"
/** Mesh GATT proxy service data out characteristic UUID */
#define MESH_GATT_SERVICE_PROXY_DATA_OUT_UUID "\xde\x2a"

/** Advertising data does not match requested network ID or node identity */
#define MESH_PROXY_SERVICE_NO_MATCH       0
/** Advertising data matches requested network ID */
#define MESH_PROXY_SERVICE_NETWORK_MATCH  1
/** Advertising data matches requested node identity */
#define MESH_PROXY_SERVICE_IDENTITY_MATCH 2

/** Advertise Mesh GATT proxy service with network ID */
#define MESH_GATT_SERVICE_PROXY_NETWORK_ID_ADV 0x00

/** Advertise Mesh GATT proxy service with node identity */
#define MESH_GATT_SERVICE_PROXY_NODE_IDENTITY_ADV 0x01

#endif /* FEATURE_MESH_GATT */

/* Provisioning algortihm bits */
/** Use FIPS-P256 for provisioning */
#define MESH_PROV_FLAG_ALGORITHM_FIPS_P256  0x0001

/* Public key type bits */
/** Out of band public key is available for provisioning */
#define MESH_PROV_FLAG_PUBLIC_KEY_AVAILABLE 0x01

/* Static OOB type bits */
/** Out of band static authentication data is available for provisioning */
#define MESH_PROV_FLAG_STATIC_OOB_AVAILABLE 0x01

/** Do not use out-of-band data in provisioning */
#define MESH_PROV_FLAG_NO_OOB 0x01
/** Use static out-of-band data in provisioning */
#define MESH_PROV_FLAG_STATIC_OOB 0x02
/** Use output out-of-band data in provisioning */
#define MESH_PROV_FLAG_OUTPUT_OOB 0x04
/** Use input out-of-band data in provisioning */
#define MESH_PROV_FLAG_INPUT_OOB 0x08

/** Flag indicating device support for out-of-band output
    authentication using blinking */
#define MESH_PROV_FLAG_OUTPUT_OOB_BLINK   0x01
/** Flag indicating device support for out-of-band output
    authentication using beeping */
#define MESH_PROV_FLAG_OUTPUT_OOB_BEEP    0x02
/** Flag indicating device support for out-of-band output
    authentication using vibration */
#define MESH_PROV_FLAG_OUTPUT_OOB_VIBRATE 0x04
/** Flag indicating device support for out-of-band output
    authentication using numeric display */
#define MESH_PROV_FLAG_OUTPUT_OOB_NUMERIC 0x08
/** Flag indicating device support for out-of-band output
    authentication using alphanumeric display */
#define MESH_PROV_FLAG_OUTPUT_OOB_ALPHA   0x10
/** Bitmask for valid out-of-band output authentication
    flags */
#define MESH_PROV_MASK_OUTPUT_OOB 0x1f

/** Flag indicating device support for out-of-band input
    authentication using push action */
#define MESH_PROV_FLAG_INPUT_OOB_PUSH   0x01
/** Flag indicating device support for out-of-band input
    authentication using twist action */
#define MESH_PROV_FLAG_INPUT_OOB_TWIST    0x02
/** Flag indicating device support for out-of-band input
    authentication using numeric input */
#define MESH_PROV_FLAG_INPUT_OOB_NUMERIC  0x04
/** Flag indicating device support for out-of-band input
    authentication using alphanumeric input */
#define MESH_PROV_FLAG_INPUT_OOB_ALPHA    0x08
/** Bitmask for valid out-of-band input authentication
    flags */
#define MESH_PROV_MASK_INPUT_OOB 0x0f

/** FIPS P-256 provisioning algorithm used in provisioning */
#define MESH_PROV_ALGORITHM_FIPS_P256 0x00

/** Out-of-band EC public key is not used in provisioning */
#define MESH_PROV_OOB_PUBLIC_KEY_NO   0x00
/** Out-of-band EC public key is used in provisioning */
#define MESH_PROV_OOB_PUBLIC_KEY_YES  0x01

/** Out-of-band authentication is not used in provisioning */
#define MESH_PROV_AUTH_OOB_NONE   0x00
/** Out-of-band static authentication is used in provisioning */
#define MESH_PROV_AUTH_OOB_STATIC 0x01
/** Out-of-band output authentication is used in provisioning */
#define MESH_PROV_AUTH_OOB_OUTPUT 0x02
/** Out-of-band input authentication is used in provisioning */
#define MESH_PROV_AUTH_OOB_INPUT  0x03

/** Out-of-band output authentication by blinking is used in provisioning */
#define MESH_PROV_OUTPUT_OOB_BLINK    0x00
/** Out-of-band output authentication by beeping is used in provisioning */
#define MESH_PROV_OUTPUT_OOB_BEEP   0x01
/** Out-of-band output authentication by vibration is used in provisioning */
#define MESH_PROV_OUTPUT_OOB_VIBRATE  0x02
/** Out-of-band output authentication by numeric output is used in provisioning */
#define MESH_PROV_OUTPUT_OOB_NUMERIC  0x03
/** Out-of-band output authentication by alphanumeric output is used in provisioning */
#define MESH_PROV_OUTPUT_OOB_ALPHA    0x04

