espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sl_btmesh_capi_types.h
/** Out-of-band input authentication by push action is used in provisioning */
#define MESH_PROV_INPUT_OOB_PUSH    0x00
/** Out-of-band input authentication by twist action is used in provisioning */
#define MESH_PROV_INPUT_OOB_TWIST   0x01
/** Out-of-band input authentication by numeric input is used in provisioning */
#define MESH_PROV_INPUT_OOB_NUMERIC   0x02
/** Out-of-band input authentication by alphanumeric input is used in provisioning */
#define MESH_PROV_INPUT_OOB_ALPHA   0x03

/** Key refresh is in progress */
#define MESH_PROV_SETUP_KR_IN_PROGRESS  0x01
/** IV index update is in progress */
#define MESH_PROV_SETUP_IVU_IN_PROGRESS 0x02

/** Advertisement provisioning bearer (PB-ADV) */
#define MESH_PROV_BEARER_ID_ADV   0x00
#if FEATURE_MESH_GATT
/** GATT provisioning bearer (PB-GATT) */
#define MESH_PROV_BEARER_ID_GATT  0x01
/** All available provisioning bearers */
#define MESH_PROV_BEARERS_MASK      ((1 << MESH_PROV_BEARER_ID_ADV) | (1 << MESH_PROV_BEARER_ID_GATT))
#else
/** All available provisioning bearers */
#define MESH_PROV_BEARERS_MASK      (1 << MESH_PROV_BEARER_ID_ADV)
#endif /* FEATURE_MESH_GATT */

/** Node is blacklisted and thus does not participate in key refresh */
#define MESH_KR_NODE_IS_BLACKLISTED 1

/** Node is not blacklisted and thus does participate in key refresh */
#define MESH_KR_NODE_IS_NOT_BLACKLISTED 0

#define MESH_PLATFORM_MEMPOOL_ID_DDB        0 /**< Device database pool */
#define MESH_PLATFORM_MEMPOOL_ID_FOUNDATION 1 /**< Foundation command pool */
#define MESH_PLATFORM_MEMPOOL_ID_DDB_APPKEY 2 /**< DDB appkey blacklist pool */
#define MESH_PLATFORM_MEMPOOL_COUNT         3 /**< Memory pool count */

/** Model handle */
typedef struct __mesh_model *mesh_model_t;

/** Element handle */
typedef struct __mesh_element *mesh_element_t;

/** Primary element index */
#define MESH_PRIMARY_ELEMENT_INDEX 0

/** Maximum useful Access message size including an opcode */
#define MESH_MAX_ACCESS_MESSAGE_SIZE 380

/** Mesh advertisement types */
typedef enum {
  mesh_packet_undefined = 0x00, /** Undefined packet type */
  mesh_packet_service_data = 0x016, /** Service data */
  mesh_packet_uri = 0x24, /**< URI advertisement */
  mesh_packet_provisioning = 0x29, /**< Provisioning data */
  mesh_packet_generic = 0x2a, /**< Mesh data */
  mesh_packet_beacon = 0x2b, /**< Mesh beacon */
} mesh_packet_type_t;

/** Mesh bearer types */
typedef enum {
  mesh_bearer_adv = 0, /**< Advertisement bearer */
#if FEATURE_MESH_GATT
  mesh_bearer_gatt = 1 /**< GATT bearer */
#endif /* FEATURE_MESH_GATT */
} mesh_bearer_t;

/** Network layer configuration structure */
typedef struct {
  uint8_t relay_interval_min; /**< Minimum relay delay */
  uint8_t relay_interval_max; /**< Maximum relay delay */
} mesh_net_config_t;

/** SAR Transmitter Configuration */
typedef struct mesh_sar_transmitter_config {
  uint32_t segment_interval_step; /**< Segment Interval Step */
  uint32_t unicast_retrans_count; /**< Unicast Retransmissions Count */
  uint32_t unicast_retrans_wo_progress_count; /**< Unicast Retransmissions Count Without Progress */
  uint32_t unicast_retrans_interval_step; /**< Unicast Retransmission Interval Step */
  uint32_t unicast_retrans_interval_increment; /**< Unicast Retransmission Interval Increment */
  uint32_t multicast_retrans_count; /**< Multicast Retransmissions Count */
  uint32_t multicast_retrans_interval_step; /**< Multicast Retransmission Interval Step */
} mesh_sar_transmitter_config_t;

/** SAR Receiver Configuration */
typedef struct mesh_sar_receiver_config {
  uint32_t segments_threshold; /**< Segments Threshold */
  uint32_t ack_delay_increment; /**< Acknowledgement Delay Increment */
  uint32_t discard_timeout; /**< Discard Timeout */
  uint32_t segment_interval_step; /**< Segment Interval Step */
  uint32_t ack_retrans_count; /**< Acknowledgement Retransmissions Count */
} mesh_sar_receiver_config_t;

/** Segmentation and reassembly configuration structure */
typedef struct {
  mesh_sar_transmitter_config_t transmitter; /**< SAR Transmitter Configuration */
  mesh_sar_receiver_config_t receiver;/**< SAR Receiver Configuration */
} mesh_trans_sar_config_t;

/**
 * Mesh device configuration structure.
 */
typedef struct {
  const mesh_net_config_t *p_net_config; /**< Network layer configuration */
  const mesh_trans_sar_config_t *p_trans_sar_config; /**< Transport layer confoiguration */
  const mesh_memory_config_t *p_memory_config; /**< Memory configuration */
  uint8_t flags; /**< Node flags */
  /* The following fields are only relevant for the Node. */
  const uint8_t *p_uuid; /**< Pointer to device UUID */
  uint16_t oob_location;   /**< OOB location bitmask */
  uint8_t oob_public_key;   /**< OOB public key availability */
  uint8_t oob_auth_methods;   /**< OOB authentication methods supported */
  uint8_t oob_auth_output_actions; /**< Output OOB actions supported bitmask */
  uint8_t oob_auth_output_size; /**< Output OOB size */
  uint8_t oob_auth_input_actions; /**< Input OOB actions supported bitmask */
  uint8_t oob_auth_input_size; /**< Input OOB size */
  uint16_t allowed_algorithms; /**< Allowed provisioning algorithms; set
                                  to bitmask containing #MESH_PROV_FLAG_ALGORITHM_FIPS_P256 */
} mesh_device_config_t;

/** Device UUID length */
#define MESH_UUID_LEN   (16)

/** Mesh size */
typedef uint16_t mesh_size_t;

/** Mesh bearer */
typedef uint8_t mesh_bearer_id;

/** Mesh address */
typedef uint16_t mesh_addr_t;

/** Mesh label UUID (full virtual address data) */
typedef struct {
  uint8_t addr[16]; /**< Address data */
} mesh_full_virtual_addr_t;

/** A special nil label UUID */
extern const mesh_full_virtual_addr_t MESH_VA_NIL;

/** Unassigned address */
#define MESH_ADDR_UNASSIGNED            0x0000
/** All IPT border routers address */
#define MESH_ADDR_ALLIPTBORDERROUTERS   0xfff9
/** All IPT nodes address */
#define MESH_ADDR_ALLIPTNODES           0xfffa
/** All nodes with directed forwarding address */
#define MESH_ADDR_ALLDIRECEDTFORWARDING 0xfffb
/** All-proxies address */
#define MESH_ADDR_ALLPROXIES            0xfffc
/** All-friends address */
#define MESH_ADDR_ALLFRIENDS            0xfffd
/** All-relays address */
#define MESH_ADDR_ALLRELAYS             0xfffe
/** All-nodes address (broadcast) */
#define MESH_ADDR_ALLNODES              0xffff

/** Mesh address types */
typedef enum {
  MESH_ADDR_TYPE_UNASSIGNED, /**< Unassigned */
  MESH_ADDR_TYPE_UNICAST, /**< Unicast address */
  MESH_ADDR_TYPE_VIRTUAL, /**< Virtual address (hash of Label UUID) */
  MESH_ADDR_TYPE_GROUP, /**< Group address */
  MESH_ADDR_TYPE_FIXEDGROUP /**< Fixed group address */
}  mesh_addr_type_t;

/**
 * @brief Get address type
 *
 * Get address type of an address
 * @param addr Mesh address
 * @return Type of the address
 */
inline mesh_addr_type_t mesh_addr_type(mesh_addr_t addr)
{
  switch ((addr >> 14) & 3) {
    case 0:
      return (addr == MESH_ADDR_UNASSIGNED)
             ? MESH_ADDR_TYPE_UNASSIGNED
             : MESH_ADDR_TYPE_UNICAST;
    case 1:
      return MESH_ADDR_TYPE_UNICAST;
    case 2:
      return MESH_ADDR_TYPE_VIRTUAL;
    default:
      return (addr >= 0xff00)
             ? MESH_ADDR_TYPE_FIXEDGROUP
             : MESH_ADDR_TYPE_GROUP;
  }
}

/** Mesh message MIC sizes */
typedef enum {
  mesh_mic_32 = 0,   // Explicitly 32 bit MIC
  mesh_mic_64 = 1,   // Explicitly 64 bit MIC
  mesh_mic_longest = 2,   // Use longest MIC which can fit in the PDU
                          // without causing extra overhead (e.g. segmentation)
} mesh_mic_t;

