espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sl_btmesh_capi_types.h
/** Mesh node handle */
typedef uint8_t mesh_node_handle_t;
/** Mesh application handle
    @deprecated Not used */
typedef uint8_t mesh_app_handle_t;
/** Mesh component handle
    @deprecated Not used */
typedef uint32_t mesh_component_handle_t;
/** Mesh packet handle
    @deprecated Not used */
typedef uint32_t mesh_packet_handle_t;
/** Mesh Tx PDU handle */
typedef void* mesh_tx_handle_t;

/** Invalid Tx handle */
#define MESH_INVALID_TX_HANDLE NULL

/** Transport layer Tx related event types */
enum mesh_trans_tx_event_type {
  mesh_trans_tx_event_obo_ack, /**< OBO acknowledgement (friend) */
  mesh_trans_tx_event_sdu_send_started, /**< Segmented TX started */
  mesh_trans_tx_event_sdu_send_completed, /**< TX completed */
  mesh_trans_tx_event_sdu_send_failed, /**< TX Failed */
};

/** Transport layer Tx related event reporting structure */
typedef struct {
  enum mesh_trans_tx_event_type type; /**< Event type */
  union {
    struct {
      mesh_addr_t obo_src; /**< friend address */
    } obo_ack; /**< On-behalf-of acknowledgement received */
  };
} mesh_trans_tx_event_t;

typedef uint8_t mesh_uuid_t[16]; /**< UUID */

/** Callback for events related to transport layer sending */
typedef void (*mesh_trans_tx_event_cb)(mesh_trans_tx_event_t *event,
                                       void *cb_param);

#if FEATURE_MESH_GATT

/**
 * GATT service
 */
typedef enum {
  mesh_gatt_service_proxy, /**< Mesh proxy service */
  mesh_gatt_service_provisioning /**< Mesh provisioning service */
} mesh_gatt_service_t;

/**
 * GATT connection handle
 */
typedef void* mesh_gatt_handle_t;

/**
 * GATT connection event types
 */
typedef enum {
  mesh_gatt_event_connected,
  mesh_gatt_event_disconnected,
  mesh_gatt_event_data
} mesh_gatt_event_type_t;

/**
 * GATT PDU type
 */
typedef enum {
  mesh_gatt_pdu_data = 0,
  mesh_gatt_pdu_beacon = 1,
  mesh_gatt_pdu_proxyconfig = 2,
  mesh_gatt_pdu_provisioning = 3,
} mesh_gatt_pdu_t;

/**
 * GATT event structure
 */
typedef struct {
  mesh_gatt_event_type_t type; /**< Event type */
  union {
    struct {
      uint8_t addr[6]; /**< Remote address */
    } connect; /**< Connection event */
    struct {
      sl_status_t reason; /**< Disconnection reason */
    } disconnect; /**< Disconnection event */
    struct {
      struct bgbuf_t *buf; /**< Data contents */
    } data; /**< Incoming data */
  };
} mesh_gatt_event_t;

/**
 * GATT event handler callback
 */
typedef void (*mesh_gatt_cb)(mesh_gatt_handle_t handle,
                             mesh_gatt_event_t *event,
                             void *cb_param);

#endif /* FEATURE_MESH_GATT */

/** Mesh AES cryptographic key type */
typedef enum {
  MESH_CRYPTO_KEY_NET = 0, /**< 128 bit network key */
  MESH_CRYPTO_KEY_APP, /**< 128 bit application key */
  MESH_CRYPTO_KEY_DEV, /**< 128 bit device key */
  MESH_CRYPTO_KEY_NONE, /**< 128 bit AES key with no mesh context */
  MESH_CRYPTO_KEY_NONE_256, /**< 256 bit AES key with no mesh context */
} mesh_crypto_key_type_t;

/** Key refresh phase */
typedef enum {
  MESH_CRYPTO_KEY_REFRESH_PHASE_NORMAL, /**< No key refresh ongoing */
  MESH_CRYPTO_KEY_REFRESH_PHASE_1, /**< Key refresh phase 1 */
  MESH_CRYPTO_KEY_REFRESH_PHASE_2, /**< Key refresh phase 2 */
  MESH_CRYPTO_KEY_REFRESH_PHASE_3, /**< Key refresh phase 3 */
} mesh_crypto_key_refresh_phase_t;

/** Mesh AES cryptographic key index */
typedef uint16_t mesh_crypto_key_index_t;

/** Invalid AES cryptographic key index */
#define MESH_CRYPTO_KEY_INDEX_INVALID 0xffff

/** Mesh AES cryptographic key length */
#define MESH_CRYPTO_KEY_LEN 16

/** Mesh AES 256 bit cryptographic key length */
#define MESH_CRYPTO_KEY_256_LEN 32

/** Mesh AES cryptographic key opaque structure */
struct mesh_crypto_key;

/** Mesh AES cryptographic key handle */
typedef struct mesh_crypto_key mesh_crypto_key_t;

/** Mesh AES MAC data maximum length */
#define MESH_CRYPTO_MAC_LEN 16

/** Mesh AES cryptographic MAC structure */
struct mesh_crypto_mac {
  uint8_t data[MESH_CRYPTO_MAC_LEN]; /**< MAC data */
};

/** Mesh AES cryptographic MAC type */
typedef struct mesh_crypto_mac mesh_crypto_mac_t;

/** Mesh HMAC-SHA-256 data length */
#define MESH_CRYPTO_HMAC_SHA_256_LEN 32

/** Mesh HMAC-SHA-256 structure */
struct  mesh_crypto_hmac_sha_256 {
  uint8_t data[MESH_CRYPTO_HMAC_SHA_256_LEN]; /**< HMAC-SHA-256 data */
};

/** Mesh HMAC-SHA-256 type */
typedef struct mesh_crypto_hmac_sha_256 mesh_crypto_hmac_sha_256_t;

/** Mesh SHA-1 data length */
#define MESH_CRYPTO_SHA_1_LEN 20

/** Mesh SHA-1 MAC type */
typedef struct {
  uint8_t data[MESH_CRYPTO_SHA_1_LEN]; /**< SHA-1 digest */
} mesh_crypto_sha1_t;

/** Mesh elliptic curve cryptographic public key length */
#define MESH_CRYPTO_EC_PUBLIC_KEY_LEN 64
/** Mesh elliptic curve cryptographic private key length */
#define MESH_CRYPTO_EC_PRIVATE_KEY_LEN  32

/** Mesh elliptic curve cryptographic key pair opaque structure */
struct mesh_crypto_ec_key;

/** Mesh elliptic curve cryptographic key pair handle */
typedef struct mesh_crypto_ec_key mesh_crypto_ec_key_t;

/** Mesh EC Diffie-Hellman shared secret opaque strcture */
struct mesh_crypto_ecdh_secret;

/** Mesh EC Diffie-Hellman shared secret handle */
typedef struct mesh_crypto_ecdh_secret mesh_crypto_ecdh_secret_t;

/** Mesh provisioning authentication data length */
#define MESH_CRYPTO_AUTH_LEN 16

/** Incoming packet */
#define MESH_PACKET_DIR_IN      0
/** Outgoing packet */
#define MESH_PACKET_DIR_OUT     1

/** Advertisement packet */
#define MESH_PACKET_TYPE_ADV    0

#define MESH_NODE_FLAG_DEBUG        1   /**< Debugging enabled */
#define MESH_NODE_FLAG_PROVISIONER  2   /**< Provisioner role */
#define MESH_NODE_FLAG_CFG_CLIENT   4   /**< Node with config client */

#define MESH_MAX_ACCESS_PDU_LEN (384)   /**< Maximum access PDU including MIC */

#define MESH_MAX_ACCESS_MESSAGE_LEN (380)   /**< Maximum access PDU excluding MIC */

/**
 * Mesh node state
 */
typedef enum {
  mesh_device_state_uninitialized = 0,
  mesh_device_state_unprovisioned,
  mesh_device_state_unprovisioned_beaconing,
  mesh_device_state_provisioning,
  mesh_device_state_operational,
  mesh_device_state_provisioner,
  mesh_device_state_last
} mesh_device_state_t;

/** Mesh provisioning process state */
typedef enum {
  mesh_prov_beaconing = 0,
  mesh_prov_link_open = 1,
  mesh_prov_key_exchange = 2,
  mesh_prov_finished = 3,
} mesh_provisioning_step_t;

