espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sl_btmesh_capi_types.h
/* Message flags */

// Replies may get artificially delayed by a random amount to avoid
//
// 1) sending a reply before original sender has managed to switch to
//    listening
//
// 2) clobbering neighbours' transmissions when multiple nodes respond
//    to the same message
//
/** Message is an access layer reply to a unicast request */
#define MESH_MESSAGE_FLAG_REPLY       0x01
/** Message is an access layer reply to a multicast request */
#define MESH_MESSAGE_FLAG_MULTICAST_REPLY 0x02

/** Message is either received with TTL=0 or is a response to such a message
    and should be sent out with TTL=0 */
#define MESH_MESSAGE_FLAG_TTL0  0x04

/** Force the use of transport layer segmentation */
#define MESH_MESSAGE_FLAG_SEGTRANS 0x10

/** Use friendship credentials instead of normal credentials
    when sending data; used when publishing with friendship
    credential flag on in model publish settings */
#define MESH_MESSAGE_FLAG_FRIENDCRED 0x20

/** Use extended packet size instead of standard */
#define MESH_MESSAGE_FLAG_EXTENDED 0x40
/** long delay needed in sending two messages in reply that need to be sent in order */
#define MESH_MESSAGE_FLAG_LONG_DELAY  0x80

/** Bearer layer message sending callback signature
 *  When the bearer packet has been sent, the callback
 *  will be called to indicate that.
 */
typedef void (*mesh_send_cb)(sl_status_t status,
                             mesh_tx_handle_t handle,
                             void *cb_param);

/* Time */

/** CPU tick or some other similar high resolution time unit */
typedef uint64_t mesh_tick_t;

/** Maximum value representable with a 64-bit uint */
#define MESH_MAX_TICK           0xffffffffffffffff

/** Low resolution time (in seconds) that advances during sleep
    modes. Used only for counting relative time differences; Epoch
    value is not important. */
typedef uint32_t mesh_clock_t;

/** Persistent storage handle to data */
typedef uint16_t mesh_pstore_handle_t;

/** Mesh model type */
typedef enum {
  MESH_MODEL_BT_SIG, /**< SIG model */
  MESH_MODEL_VENDOR /**< Vendor model */
} mesh_model_type_t;

/** Model publication state */
typedef struct {
  mesh_addr_t addr;   /**< Publication address */
  mesh_full_virtual_addr_t va;   /**< Full virtual address data; needed if
                                    publication address is a virtual one */
  mesh_crypto_key_index_t key_index;   /**< Publication app key */
  uint8_t ttl;   /**< Publication time to live */
  uint8_t period;   /**< Publication period */
  uint8_t retrans;   /**< Retransmission count and interval */
  uint8_t friendcred : 1; /**< Use friendship credentials flag */
} mesh_model_publish_t;

/** Model transmission options */
typedef struct {
  uint8_t extended_packet_size : 1; /**< Use extended packet size */
} mesh_model_tx_options_t;

/** Cryptographic key event */
typedef enum {
  key_added = 0,
  key_updated = 1,
  key_deleted = 2,
  key_last,
} mesh_key_event_t;

/** Model configuration event */
typedef enum {
  model_appkey_bindings_changed = 0,
  model_publication_changed = 1,
  model_subscriptions_changed = 2,
  model_last,
} mesh_model_config_event_t;

/** Dummy vendor ID for Mesh specification models
    @deprecated Use MESH_SPEC_VENDOR_ID instead */
#define MESH_VENDOR_ID_SIG      0xffff

/** TTL value indicating default TTL should be used */
#define MESH_USE_DEFAULT_TTL (255)

/** Instrumentation event */
typedef enum {
  mesh_instr_hello = 0x00,

  mesh_instr_net_pdu_decryption_failure = 0x01,
  mesh_instr_net_pdu_decrypted = 0x02,
  mesh_instr_net_pdu_dropped = 0x03,
  mesh_instr_net_pdu_handled = 0x04,
  mesh_instr_net_pdu_not_handled = 0x05,
  mesh_instr_net_pdu_relayed = 0x06,
  mesh_instr_net_pdu_not_relayed = 0x07,
  mesh_instr_net_pdu_sent = 0x08,
  mesh_instr_net_pdu_not_sent = 0x09,

  mesh_instr_trans_pdu_handled = 0x0a,
  mesh_instr_trans_pdu_not_handled = 0x0b,
  mesh_instr_trans_receiver_start = 0x0c,
  mesh_instr_trans_receiver_cleanup = 0x0d,
  mesh_instr_trans_receiver_recv = 0x0e,
  mesh_instr_trans_receiver_ack_sent = 0x0f,
  mesh_instr_trans_receiver_ack_not_sent = 0x10,
  mesh_instr_trans_receiver_timer_set = 0x11,
  mesh_instr_trans_receiver_timer_expired = 0x12,

  mesh_instr_trans_sender_start = 0x13,
  mesh_instr_trans_sender_table_full = 0x14,
  mesh_instr_trans_sender_cleanup = 0x15,
  mesh_instr_trans_sender_ack_handled = 0x16,
  mesh_instr_trans_sender_ack_not_handled = 0x17,
  mesh_instr_trans_sender_pdu_sent = 0x18,
  mesh_instr_trans_sender_pdu_not_sent = 0x19,
  mesh_instr_trans_sender_sdu_sent = 0x1a,
  mesh_instr_trans_sender_sdu_not_sent = 0x1b,
  mesh_instr_trans_sender_timer_set = 0x1c,
  mesh_instr_trans_sender_timer_expired = 0x1d,

  mesh_instr_adv_sent = 0x1e,
  mesh_instr_adv_not_sent = 0x1f,
  mesh_instr_adv_queue_push = 0x20,
  mesh_instr_adv_queue_pop = 0x21,

  mesh_instr_tx_complete = 0x22,
  mesh_instr_tx_cancelled = 0x23,
} mesh_instr_event_t;

/** Instrumentation result codes for dropping a network PDU */
typedef enum {
  mesh_instr_net_pdu_dropped_cache_hit = 0x00,
  mesh_instr_net_pdu_dropped_invalid_src = 0x01,
  mesh_instr_net_pdu_dropped_invalid_dst = 0x02,
  mesh_instr_net_pdu_dropped_internal_error = 0x03,
} mesh_instr_net_pdu_dropped_reason_t;
/** Number of instrumentation errors for dropping a network PDU */
#define mesh_instr_net_pdu_dropped_reasons 4

/** Instrumentation result codes for not handling a network PDU */
typedef enum {
  mesh_instr_net_pdu_not_handled_not_for_me = 0x00,
} mesh_instr_net_pdu_not_handled_reason_t;
/** Number of instrumentation errors for not handling a network PDU */
#define mesh_instr_net_pdu_not_handled_reasons 1

/** Instrumentation result codes for not relaying a network PDU */
typedef enum {
  mesh_instr_net_pdu_not_relayed_no_relay = 0x00,
  mesh_instr_net_pdu_not_relayed_hop_limit = 0x01,
  mesh_instr_net_pdu_not_relayed_out_of_memory = 0x02,
  mesh_instr_net_pdu_not_relayed_internal_error = 0x03,
} mesh_instr_net_pdu_not_relayed_reason_t;
/** Number of instrumentation errors for not relaying a network PDU */
#define mesh_instr_net_pdu_not_relayed_reasons 4

