espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sl_btmesh_capi_types.h
/** Instrumentation result codes for not sending a network PDU */
typedef enum {
  mesh_instr_net_pdu_not_sent_out_of_memory = 0x00,
  mesh_instr_net_pdu_not_sent_internal_error = 0x01,
  mesh_instr_net_pdu_not_sent_hop_limit = 0x02,
} mesh_instr_net_pdu_not_sent_reason_t;
/** Number of instrumentation errors for not sending a network PDU */
#define mesh_instr_net_pdu_not_sent_reasons 3

/** Instrumentation result codes for not handling a transport PDU */
typedef enum {
  mesh_instr_trans_pdu_not_handled_invalid_pdu = 0x00,
  mesh_instr_trans_pdu_not_handled_invalid_src = 0x01,
  mesh_instr_trans_pdu_not_handled_invalid_dst = 0x02,
  mesh_instr_trans_pdu_not_handled_invalid_seg = 0x03,
  mesh_instr_trans_pdu_not_handled_old_seqauth = 0x04,
  mesh_instr_trans_pdu_not_handled_old_data = 0x05,
  mesh_instr_trans_pdu_not_handled_out_of_recv = 0x06,
  mesh_instr_trans_pdu_not_handled_out_of_memory = 0x07,
  mesh_instr_trans_pdu_not_handled_header_mismatch = 0x08,
} mesh_instr_trans_pdu_not_handled_reason_t;
/** Number of instrumentation errors for not handling a transport PDU */
#define mesh_instr_trans_pdu_not_handled_reasons 9

/** Instrumentation result codes for not sending a transport layer acknowledgement */
typedef enum {
  mesh_instr_trans_ack_not_sent_out_of_memory = 0x00,
  mesh_instr_trans_ack_not_sent_internal_error = 0x01,
} mesh_instr_trans_ack_not_sent_reason_t;
/** Number of instrumentation errors for not sending transport layer acknowledgement */
#define mesh_instr_trans_receiver_ack_not_sent_reasons 2

/** Instrumentation result codes for not handling a transport layer acknowledgement */
typedef enum {
  mesh_instr_trans_ack_not_handled_not_found = 0x00,
  mesh_instr_trans_ack_not_handled_non_cumulative = 0x01,
} mesh_instr_trans_ack_not_handled_reason_t;
/** Number of instrumentation errors for not handling transport layer acknowledgement */
#define mesh_instr_trans_sender_ack_not_handled_reasons 2

/** Instrumentation result codes for receiving a transport layer message */
typedef enum {
  mesh_instr_trans_receive_success = 0x00,
  mesh_instr_trans_receive_incomplete = 0x01,
  mesh_instr_trans_receive_sender_cancelled = 0x02,
  mesh_instr_trans_receive_receiver_cancelled = 0x03,
} mesh_instr_trans_receive_status_t;
/** Number of instrumentation errors for transport layer message reception */
#define mesh_instr_trans_receiver_receive_reasons 3

/** Instrumentation result codes for not sending a transport layer PDU */
typedef enum {
  mesh_instr_trans_pdu_not_sent_wrong_state = 0x00,
  mesh_instr_trans_pdu_not_sent_out_of_memory = 0x01,
  mesh_instr_trans_pdu_not_sent_internal_error = 0x02,
} mesh_instr_trans_pdu_not_sent_reason_t;
/** Number of instrumentation errors for not sending transport layer PDU */
#define mesh_instr_trans_sender_pdu_not_sent_reasons 3

/** Instrumentation result codes for not sending a transport layer SDU */
typedef enum {
  mesh_instr_trans_sdu_not_sent_invalid_src = 0x00,
  mesh_instr_trans_sdu_not_sent_invalid_dst = 0x01,
  mesh_instr_trans_sdu_not_sent_invalid_key = 0x02,
  mesh_instr_trans_sdu_not_sent_wrong_state = 0x03,
  mesh_instr_trans_sdu_not_sent_out_of_memory = 0x04,
  mesh_instr_trans_sdu_not_sent_internal_error = 0x05,
} mesh_instr_trans_sdu_not_sent_reason_t;
/** Number of instrumentation errors for not sending transport layer SDU */
#define mesh_instr_trans_sender_sdu_not_sent_reasons 6

/** Instrumentation result codes for sending a transport layer message */
typedef enum {
  mesh_instr_trans_send_success = 0x00,
  mesh_instr_trans_send_timeout = 0x01,
  mesh_instr_trans_send_receiver_cancelled = 0x02,
  mesh_instr_trans_send_out_of_memory = 0x03,
  mesh_instr_trans_send_internal_error = 0x04,
  mesh_instr_trans_send_sender_cancelled = 0x05,
} mesh_instr_trans_send_status_t;
/** Number of instrumentation errors for transport layer message sending */
#define mesh_instr_trans_sender_send_reasons 5

/** Mesh stack statistics counters */
typedef struct {
  /** Network decryption failure counter */
  uint32_t net_pdu_decryption_failure;
  /** Network decryption success counter */
  uint32_t net_pdu_decrypted;
  /** Network PDU dropped counter */
  uint32_t net_pdu_dropped[mesh_instr_net_pdu_dropped_reasons];
  /** Network PDU handled counter */
  uint32_t net_pdu_handled;
  /** Network PDU not handled counter */
  uint32_t net_pdu_not_handled[mesh_instr_net_pdu_not_handled_reasons];
  /** Network PDU relayed counter */
  uint32_t net_pdu_relayed;
  /** Network PDU not relayed counter */
  uint32_t net_pdu_not_relayed[mesh_instr_net_pdu_not_relayed_reasons];
  /** Network PDU sent counter */
  uint32_t net_pdu_sent;
  /** Network PDU not sent counter */
  uint32_t net_pdu_not_sent[mesh_instr_net_pdu_not_sent_reasons];

  /** Transport PDU processed counter */
  uint32_t trans_pdu_handled;
  /** Transport PDU not handled counter */
  uint32_t trans_pdu_not_handled[mesh_instr_trans_pdu_not_handled_reasons];

  /** Transport SDU reception started counter */
  uint32_t trans_receiver_start;
  /** Transport SDU reception ended counter */
  uint32_t trans_receiver_cleanup[mesh_instr_trans_receiver_receive_reasons];
  /** Transport SDU received counter */
  uint32_t trans_receiver_recv;
  /** Transport acknowledgement sent counter */
  uint32_t trans_receiver_ack_sent;
  /** Transport acknowledgement not sent counter */
  uint32_t trans_receiver_ack_not_sent[mesh_instr_trans_receiver_ack_not_sent_reasons];
  /** Transport receive timer set counter */
  uint32_t trans_receiver_timer_set;
  /** Transport receive timer expired counter */
  uint32_t trans_receiver_timer_expired;

  /** Transport sender started counter */
  uint32_t trans_sender_start;
  /** Transport sender out of resources counter */
  uint32_t trans_sender_table_full;
  /** Transport sender ended counter */
  uint32_t trans_sender_cleanup[mesh_instr_trans_sender_send_reasons];
  /** Transport acknowledgement handled counter */
  uint32_t trans_sender_ack_handled;
  /** Transport acknowledgement not handled counter */
  uint32_t trans_sender_ack_not_handled[mesh_instr_trans_sender_ack_not_handled_reasons];
  /** Transport PDU sent counter */
  uint32_t trans_sender_pdu_sent;
  /** Transport PDU not sent counter */
  uint32_t trans_sender_pdu_not_sent[mesh_instr_trans_sender_pdu_not_sent_reasons];
  /** Transport SDU sent counter */
  uint32_t trans_sender_sdu_sent;
  /** Transport SDU not sent counter */
  uint32_t trans_sender_sdu_not_sent[mesh_instr_trans_sender_sdu_not_sent_reasons];
  /** Transport sender timer set counter */
  uint32_t trans_sender_timer_set;
  /** Transport sender timer expired counter */
  uint32_t trans_sender_timer_expired;
} mesh_statistics_t;

/** Pointer to current mesh statistics */
extern mesh_statistics_t *mesh_stats;

/** Instrumentation result codes for not sending an advertisement */
typedef enum {
  mesh_instr_adv_not_sent_out_of_memory = 0x00,
  mesh_instr_adv_not_sent_internal_error = 0x01,
} mesh_instr_adv_not_sent_reason_t;

/** Instrumentation result codes for removing an advertisement from send queue */
typedef enum {
  mesh_instr_adv_queue_pop_finished = 0x00,
  mesh_instr_adv_queue_pop_cancelled = 0x01,
} mesh_instr_adv_queue_pop_reason_t;

