espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sl_btmesh_capi_types.h
/** Convert integer to pointer */
#define MESH_I2P(i) ((void *)((uintptr_t)(i)))

/** Convert pointer to integer */
#define MESH_P2I(p) ((uintptr_t)(p))

/** Scheduled callback function.
    A scheduled callback will be called by
    the platform once a request made by the mesh stack, by calling
    mesh_platform_callback_schedule() has expired. */
typedef void (*mesh_scheduled_cb_fn)(uint32_t handle, void *ctx);

/** Scheduled callback function. for non-cancellable events
    A scheduled callback will be called by
    the platform once a request made by the mesh stack, by calling
    mesh_platform_callback_schedule_event() has expired. */
typedef void (*mesh_scheduled_event_cb_fn)(uint32_t event, void *ctx);

/** Stack diagnostic event types */
typedef enum {
  mesh_stack_diag_event_config_server_beacon_set,
  mesh_stack_diag_event_config_server_default_ttl_set,
  mesh_stack_diag_event_config_server_friend_set,
  mesh_stack_diag_event_config_server_gatt_proxy_set,
  mesh_stack_diag_event_config_server_nettx_set,
  mesh_stack_diag_event_config_server_node_identity_set,
  mesh_stack_diag_event_config_server_relay_set,
  mesh_stack_diag_event_config_server_beacon_get,
  mesh_stack_diag_event_config_server_default_ttl_get,
  mesh_stack_diag_event_config_server_friend_get,
  mesh_stack_diag_event_config_server_gatt_proxy_get,
  mesh_stack_diag_event_config_server_nettx_get,
  mesh_stack_diag_event_config_server_node_identity_get,
  mesh_stack_diag_event_config_server_relay_get,

  mesh_stack_diag_event_replay_protection_list_load,
  mesh_stack_diag_event_replay_protection_list_save,
  mesh_stack_diag_event_replay_protection_list_flush,
  mesh_stack_diag_event_replay_protection_list_set_entry,
  mesh_stack_diag_event_replay_protection_list_clear_entry,
  mesh_stack_diag_event_replay_protection_list_full,

  mesh_stack_diag_event_sar_config_server_transmitter_set,
  mesh_stack_diag_event_sar_config_server_receiver_set,
} mesh_stack_diag_event_type_t;

/** Diagnostic event for configuration server change */
typedef union {
  uint8_t beacon; /**< Value of beacon state after set request */
  uint8_t default_ttl; /**< Value of default TTL state after set request */
  uint8_t friend_; /**< Value of friend state after set request */
  uint8_t gatt_proxy; /**< Value of GATT proxy state after set request */
  struct {
    uint8_t count;
    uint8_t interval;
  } nettx; /**< Value of network transmit state after set request */
  struct {
    mesh_crypto_key_index_t index;
    uint8_t enabled;
  } node_identity; /**< Value of node identity state after set request */
  struct {
    uint8_t enabled;
    uint8_t count;
    uint8_t interval;
  } relay; /**< Value of relay state after set request */
} mesh_stack_diag_event_config_server_t;

/** Diagnostic event for replay protection list */
typedef union {
  struct {
    uint16_t loaded_count;
    uint16_t total_count;
    sl_status_t result;
  } load; /**< Replay protection list loaded from flash */
  struct {
    uint16_t saved_count;
    uint16_t total_count;
    sl_status_t result;
  } save; /**< Replay protection list saved to flash */
  // Nothing for flush
  struct {
    mesh_addr_t src;
    bool cancel;
  } set; /**< Replay protection list entry set */
  struct {
    mesh_addr_t src;
  } clear; /**< Replay protection list entry removed */
  // Nothing for full
} mesh_stack_diag_event_replay_protection_list_t;

/** Diagnostic event for SAR configuration server change */
typedef union {
  mesh_sar_transmitter_config_t transmitter; /**< SAR Transmitter configuration value after set request */
  mesh_sar_receiver_config_t receiver; /**< SAR Receiver configuration value after set request */
} mesh_stack_diag_event_sar_config_server_t;

/** Stack diagnostic event */
typedef struct {
  mesh_stack_diag_event_type_t type; /**< Event type */
  union {
    mesh_stack_diag_event_config_server_t config_server; /**< Config server event */
    mesh_stack_diag_event_replay_protection_list_t replay_protection_list; /**< Replay protection list event */
    mesh_stack_diag_event_sar_config_server_t sar_config_server; /**< SAR Config server event */
  };
} mesh_stack_diag_event_t;

/**
 * Stack diagnostic event handler callback
 */
typedef void (*mesh_stack_diag_event_cb)(const mesh_stack_diag_event_t *event);

/** Secure network beacon callback; called when a secure network
    beacon is successfully received */
typedef void (*mesh_network_beacon_cb)(mesh_crypto_key_index_t net_key_index,
                                       uint8_t key_refresh,
                                       uint8_t iv_update,
                                       uint32_t ivindex);

/** Unprovisioned device beacon callback; called when an unprovisioned
    device beacon is successfully received */
typedef void (*mesh_unprov_beacon_cb)(const uint8_t *uuid,
                                      uint16_t oob,
                                      const uint8_t *uri_hash,
                                      mesh_bearer_t bearer,
                                      const uint8_t *bdaddr,
                                      uint8_t bdaddr_type,
                                      int8_t rssi);

/** Application layer message sending function signature; mainly
    needed for easier writing of unit tests */
typedef sl_status_t (*mesh_app_send_fn)(mesh_crypto_key_type_t app_key_type,
                                        mesh_crypto_key_index_t app_key_index,
                                        mesh_crypto_key_index_t net_key_index,
                                        mesh_addr_t src,
                                        mesh_addr_t dst,
                                        const mesh_full_virtual_addr_t *va,
                                        mesh_mic_t szmict,
                                        mesh_model_t model,
                                        struct bgbuf_t *message,
                                        uint8_t message_flags,
                                        uint8_t ttl,
                                        mesh_send_cb cb,
                                        mesh_trans_tx_event_cb tx_cb,
                                        void *cb_param);

/**
 * event id for application information events
 */
typedef  enum {
  mesh_prov_capabilites_evt = 100,
  mesh_prov_provisioning_suspended_evt,
  mesh_prov_provisioning_start_evt,
  mesh_prov_rfu_1_evt,
  mesh_prov_rfu_2_evt,
  mesh_prov_rfu_3_evt,
  mesh_prov_rfu_4_evt,
  mesh_prov_rfu_5_evt,
} mesh_prov_event_type_t;

/**
 * reason code indicating why provisioning was suspended
 */
typedef enum {
  mesh_prov_reason_capabilities = 0,
  mesh_prov_reason_link_open = 1,
} mesh_prov_suspension_reason_t;

/** Suspend provisioning when Capabilities PDU has been received */
#define MESH_PROV_SUSPENSION_FLAG_CAPABILITIES (1 << 0)

/** Suspend provisioning when provisioning session is open */
#define MESH_PROV_SUSPENSION_FLAG_LINK_OPEN (1 << 1)

/**
 * call back to carry events
 */
typedef void (*provisioner_event_handler_cb)(mesh_prov_event_type_t event_type,
                                             const uint8_t *uuid,
                                             uint8_t len,
                                             const uint8_t *data);

/**
 * GATT Service advertisement type
 */
typedef enum {
  mesh_gatt_adv_type_provisioning_service = 0,
  mesh_gatt_adv_type_proxy_service,
  mesh_gatt_adv_rfu_1,
  mesh_gatt_adv_type_last
} mesh_gatt_adv_type_t;

#endif
